app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "director" = 'George Lucas', "release_date" = '2006-05-25 00:00:00.000000', "updated_at" = '2016-04-03 09:25:44.362500' WHERE "movies"."id" = 11
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def directors
    @movie = Movie.find params[:id]